[{"Title":"People who haven't pooped in 2019 yet, why are you still holding on to last years shit?","Score":221995,"URL":"https:\/\/www.reddit.com\/r\/AskReddit\/comments\/ablzuq\/people_who_havent_pooped_in_2019_yet_why_are_you\/","Post Author":"ShoddySubstance","Comments":[{"Comment":"It's all I have","Upvotes":46491,"Comment Author":"NaziGazpacho","Comment Posted Time":"4 years ago"},{"Comment":"[deleted]","Upvotes":35940,"Comment Author":"deleted","Comment Posted Time":"4 years ago"},{"Comment":"Bold of you to assume I'm going to take a shit this year.","Upvotes":34853,"Comment Author":"abksploder","Comment Posted Time":"4 years ago"},{"Comment":"\"Fuck you, I won't poo when you tell me\"","Upvotes":28367,"Comment Author":"ThreeSheetzToTheWind","Comment Posted Time":"4 years ago"},{"Comment":"Everyone now thinking about the last time they pooped. Nicely played. ","Upvotes":26830,"Comment Author":"Lady_Minuit","Comment Posted Time":"4 years ago"},{"Comment":"Im letting go right now as I type. ","Upvotes":26562,"Comment Author":"PrinceofallRabbits","Comment Posted Time":"4 years ago"},{"Comment":"Quality shitpost ","Upvotes":25192,"Comment Author":"groggy05","Comment Posted Time":"4 years ago"},{"Comment":"im constipated   Edit: Free Bobby Shmurda","Upvotes":20416,"Comment Author":"DadAsFuck","Comment Posted Time":"4 years ago"},{"Comment":"We have guests and I literally can't relax.","Upvotes":19267,"Comment Author":"adsadsadsadsads","Comment Posted Time":"4 years ago"},{"Comment":"Lets see who can go the longest in 2019 without taking a shit  Edit: This blew up..","Upvotes":15836,"Comment Author":"Fushigibama","Comment Posted Time":"4 years ago"}]},{"Title":"How would you feel about Reddit adding 3 NSFW filters to distinguish between porn, gore, and repetitive posts asking how you would feel about Reddit adding 2 NSFW filters to distinguish between porn and gore?","Score":217925,"URL":"https:\/\/www.reddit.com\/r\/AskReddit\/comments\/l7530r\/how_would_you_feel_about_reddit_adding_3_nsfw\/","Post Author":"SoupIsAHotSmoothie","Comments":[{"Comment":"While we're at it can we add a fourth filter for posts asking if you'd be willing to stub your toe for a billion dollars?","Upvotes":29371,"Comment Author":"monster860","Comment Posted Time":"2 years ago"},{"Comment":"[removed]","Upvotes":20098,"Comment Author":"deleted","Comment Posted Time":"2 years ago"},{"Comment":"This is a brilliant idea. Maybe just have 2 NSFW filters. One which covers gore and porn then another for the repetitive questions.","Upvotes":12381,"Comment Author":"deleted","Comment Posted Time":"2 years ago"},{"Comment":"HOW DO YOU FEEL ABOUT HOW DO YOU FEEL POSTS ABOUT HOW YOU FEEL????","Upvotes":7721,"Comment Author":"Blu3-Panth3r","Comment Posted Time":"2 years ago"},{"Comment":"Yes JFC can we please ban how would you feel about [objectively good thing] posts","Upvotes":2905,"Comment Author":"nowthenight","Comment Posted Time":"2 years ago"},{"Comment":"I had a stroke reading this","Upvotes":2082,"Comment Author":"Which-Palpitation","Comment Posted Time":"2 years ago"},{"Comment":"[deleted]","Upvotes":1227,"Comment Author":"deleted","Comment Posted Time":"2 years ago"},{"Comment":"successfully reading the title without stuttering in my brain made me feel smart","Upvotes":708,"Comment Author":"lubedupsportsvan","Comment Posted Time":"2 years ago"},{"Comment":"I am so sick of this question. Its literally one of the top posts of all time on here and I feel like I see it every week  Edit: Before anyone else replies, I knew that this post was a joke before I posted my comment. I was complaining about the frequency of the other question in this thread but I must've worded it badly","Upvotes":638,"Comment Author":"Sceptile90","Comment Posted Time":"2 years ago"},{"Comment":"Nsfw for porn, nsfl for gore.","Upvotes":374,"Comment Author":"billythesquid233","Comment Posted Time":"2 years ago"}]},{"Title":"Would you watch a show where a billionaire CEO has to go an entire month on their lowest paid employees salary, without access to any other resources than that of the employee? What do you think would happen?","Score":197601,"URL":"https:\/\/www.reddit.com\/r\/AskReddit\/comments\/f08dxb\/would_you_watch_a_show_where_a_billionaire_ceo\/","Post Author":"txhorns1330","Comments":[{"Comment":"3 months minimum and I'd watch it  Thanks for the gold!!","Upvotes":49114,"Comment Author":"HunterSG1","Comment Posted Time":"3 years ago"},{"Comment":"There was this similar themed show in Hongkong and Mainland China years ago.  They swapped billionare with bottom feeders, let the rich do the basical job, on the lowest salary, to see how far the rich could go by purely their own effort.   Nearly all of the billionare admitted that they could not make anywhere, regardless of how hard they worked, even working without sleeping and resting could not give you any accumulation to help climb up to the higher level of the society.  There was only despair, and admission that the divide between the poor and the rich is already a deep valley and mere personal effort makes little sense.  It stirred big debate among the society back then, and I think that was part of the reaons the show got cancelled .  There was also another show in China, swapping senior political figures with community level council workers, to see how good they could do in each other's posts. The mayors were flooded by the angry mobs who kept asking for more and more benefits that were impossible to fullfil, by the end had to admit the amount of work at basic community level was too much to archieve anywhere.  The show also got cancelled quite soon after a few episodes.","Upvotes":38088,"Comment Author":"Eggmatros","Comment Posted Time":"3 years ago"},{"Comment":"I love Reality shows so I'd watch it depending on who produces it.   If it's too fake, with too many \"emotional\" moments, advertising and people shouting, I'm out.","Upvotes":25116,"Comment Author":"LukeCloudStalker","Comment Posted Time":"3 years ago"},{"Comment":"Its more than just the money. Its the lack of security these people endure. Not knowing if youll lose your job tomorrow and having no savings. Being kicked out of your home. An unexpected bill you cant afford, which may lead to increasing debt.   Putting these rich people in a poor lifestyle for a month isnt enough. Even if they lost their money and homes, theyll have such a huge network that theyll be back on their feet in the time it takes for us peons to earn enough to eat for a week. They can never truly understand what its like to be poor or ever face that reality again.   So what would happen? Itd be a completely self-serving advert about how now I realise that we need to do more for our employees. The workers get a small vanity bonus, probably give an immigrant worker with limited English a car, pat themselves on the back. Then two weeks later, weve all forgotten about the show and theyll go back to their old ways.","Upvotes":12789,"Comment Author":"Dannypan","Comment Posted Time":"3 years ago"},{"Comment":"They'd be fine.  The problem with poverty is not usually day-to-day costs. People can adjust to that.  It's unexpected expenses that are crippling.  ~~*Edit: Why are people still responding two weeks later! Nobody is reading this thread any more! At least not the responses at the bottom*~~ (Edit2: rant was too whiney. If you have something to say, who am I to say otherwise?)","Upvotes":12349,"Comment Author":"squigs","Comment Posted Time":"3 years ago"},{"Comment":"It would be incredibly self-serving and boring. They would never truly experience what it is like to be in the precarious position of a minimum wage employee living hand-to-mouth and the 'novelty' is just salt in the wound.   It would be more interesting to see the reverse.","Upvotes":9074,"Comment Author":"theacemaverick","Comment Posted Time":"3 years ago"},{"Comment":"I doubt a month is enough to really feel the effect","Upvotes":8286,"Comment Author":"_rightClick_","Comment Posted Time":"3 years ago"},{"Comment":"Sure. They would never do that though, because then they would have to admit that they don't pay a living wage.","Upvotes":4452,"Comment Author":"deleted","Comment Posted Time":"3 years ago"},{"Comment":"Lots of rich people voluntarily go on vacation to third world countries. The catch is, they know they have a way out and an end date.   I'd be interested to watch a show where the CEO had to personally be financially responsible for the welfare of 50% of their lowest payed employees for 10 years, and their net growth percentage equalled their bonus every year, with a big bonus if both the company and the employees were profitable at the end.","Upvotes":1648,"Comment Author":"ade1aide","Comment Posted Time":"3 years ago"},{"Comment":"Isnt this almost the same as secret millionaire? Do you guys have that in the US?","Upvotes":742,"Comment Author":"Adam-West","Comment Posted Time":"3 years ago"}]},{"Title":"What if God came down one day and said \"It's pronounced 'Jod' then left?","Score":195918,"URL":"https:\/\/www.reddit.com\/r\/AskReddit\/comments\/iwedc5\/what_if_god_came_down_one_day_and_said_its\/","Post Author":"esi_disi","Comments":[{"Comment":"I recognize the council has made a decision, but given that its a stupid-ass decision, Ive elected to ignore it.","Upvotes":49859,"Comment Author":"tealhouse","Comment Posted Time":"2 years ago"},{"Comment":"A large chunk of my taking the lord's name in vain would go away.","Upvotes":47673,"Comment Author":"tacknosaddle","Comment Posted Time":"2 years ago"},{"Comment":"#Joddamnit.","Upvotes":34334,"Comment Author":"NiceBeaver2018","Comment Posted Time":"2 years ago"},{"Comment":"[removed]","Upvotes":28992,"Comment Author":"deleted","Comment Posted Time":"2 years ago"},{"Comment":"Does that mean Jesus would be pronounced Geezus?","Upvotes":23631,"Comment Author":"BarkerDrums","Comment Posted Time":"2 years ago"},{"Comment":"Wed be like, No way! and hed be like, Yahweh.  edit: holy shit, yall are making my day","Upvotes":22715,"Comment Author":"torta-di-luna","Comment Posted Time":"2 years ago"},{"Comment":"Then all of Scandinavia will pronounce it like \"Yod\" and the Spanish will pronounce it like \"Hod\"","Upvotes":16515,"Comment Author":"PM-Me-Your-TitsPlz","Comment Posted Time":"2 years ago"},{"Comment":"You'd have different religious factions arguing that they're right and the other is wrong  Oh wait","Upvotes":15754,"Comment Author":"NotNinjalord5","Comment Posted Time":"2 years ago"},{"Comment":"He would also say, my name isnt God then he would pronounce his name and everyones faces would melt.","Upvotes":7909,"Comment Author":"Sed_Said","Comment Posted Time":"2 years ago"},{"Comment":"I would be converted   Edit: thanks for the upvotes and awards guys!=D","Upvotes":7407,"Comment Author":"KittenChopper","Comment Posted Time":"2 years ago"}]},{"Title":"How would you feel about a feature where if someone upvotes a crosspost, the original post is upvoted automatically?","Score":186430,"URL":"https:\/\/www.reddit.com\/r\/AskReddit\/comments\/draola\/how_would_you_feel_about_a_feature_where_if\/","Post Author":"Ka1-","Comments":[{"Comment":"what about subs that crosspost from other subs to mock them?","Upvotes":44646,"Comment Author":"samoyedboi","Comment Posted Time":"3 years ago"},{"Comment":"The karmaceutical companies would be outraged.","Upvotes":35661,"Comment Author":"deleted","Comment Posted Time":"3 years ago"},{"Comment":"[deleted]","Upvotes":13757,"Comment Author":"deleted","Comment Posted Time":"3 years ago"},{"Comment":"Would prevent karma theft","Upvotes":6768,"Comment Author":"KameronGaming_HQ","Comment Posted Time":"3 years ago"},{"Comment":"[removed]","Upvotes":5817,"Comment Author":"deleted","Comment Posted Time":"3 years ago"},{"Comment":"It would be weird to see a post in a smaller subreddit with thousands of points just because it got crossposted somewhere more popular.","Upvotes":3412,"Comment Author":"phaeton83","Comment Posted Time":"3 years ago"},{"Comment":"Will totally lead to abuse","Upvotes":820,"Comment Author":"HookDragger","Comment Posted Time":"3 years ago"},{"Comment":"The thing is that a good post on one sub might be a bad post on another. If something is relevant in one sub but irrelevant in another, the downvotes from the sub where it's not relevant would take upvotes from the post that's highly relevant.","Upvotes":579,"Comment Author":"Brand-Spanking-New","Comment Posted Time":"3 years ago"},{"Comment":"Karma farmers will just download and reupload the image before posting instead of using the crosspost function.       Regardless, I think it'd be a nice feature.","Upvotes":405,"Comment Author":"Fisherman_Gabe","Comment Posted Time":"3 years ago"},{"Comment":"Ehh, sometimes you crosspost because OP was a dick, so no","Upvotes":200,"Comment Author":"alex-the-hero","Comment Posted Time":"3 years ago"}]},{"Title":"How would you feel about a \"if you accidentally scroll to the top, you can go back to where you were,\" button for Reddit?","Score":182984,"URL":"https:\/\/www.reddit.com\/r\/AskReddit\/comments\/kr8op6\/how_would_you_feel_about_a_if_you_accidentally\/","Post Author":"Cheap_Double9726","Comments":[{"Comment":"Found this after accidentally losing my place and starting at the top. Give me my place back, Reddit!","Upvotes":40679,"Comment Author":"Pugkin5405","Comment Posted Time":"2 years ago"},{"Comment":"How would you feel about this question being asked again, just formatted differently?","Upvotes":18423,"Comment Author":"HerbieVerSmelles4247","Comment Posted Time":"2 years ago"},{"Comment":"*Laughs in Apollo*","Upvotes":7327,"Comment Author":"deleted","Comment Posted Time":"2 years ago"},{"Comment":"For some reason, reddit cannot be reached when loading the area you were at previously, and thus something went wrong with the scrolling back. Just don't panic!","Upvotes":6339,"Comment Author":"Odin_Allfathir","Comment Posted Time":"2 years ago"},{"Comment":"Why does this get upvoted in r\/askReddit? It's something that everyone would either very much like to have, or would not mind having. No point in asking these questions here imo","Upvotes":3474,"Comment Author":"Coltsfan1887","Comment Posted Time":"2 years ago"},{"Comment":"'specially when I'm down 500 pages from top of all after about 4 days of grinding it that far only to lose it all from an accidental computer shut down","Upvotes":3203,"Comment Author":"beluuuuuuga","Comment Posted Time":"2 years ago"},{"Comment":"can i post this question next week? mum said its my turn.","Upvotes":1874,"Comment Author":"anteriino","Comment Posted Time":"2 years ago"},{"Comment":"Why am i seeing this post for at least a third time","Upvotes":980,"Comment Author":"RealnyMail","Comment Posted Time":"2 years ago"},{"Comment":"For fucks sake stop asking this damn question. It doesn't even belong in this sub","Upvotes":530,"Comment Author":"Majestymen","Comment Posted Time":"2 years ago"},{"Comment":"How would you feel if these stupid types of questions were banned. You wouldn't be able to farm your sweet karma.","Upvotes":357,"Comment Author":"chefboyardee193","Comment Posted Time":"2 years ago"}]},{"Title":"Stan Lee has passed away at 95 years old","Score":175370,"URL":"https:\/\/www.reddit.com\/r\/AskReddit\/comments\/9whgf4\/stan_lee_has_passed_away_at_95_years_old\/","Post Author":"-eDgAR-","Comments":[{"Comment":"Was really hoping he'd get to see Avengers 4, but at least he did get to see and interact with his creations on the big screen.  RIP.  ","Upvotes":11938,"Comment Author":"deleted","Comment Posted Time":"4 years ago"},{"Comment":"His wife passed away not too long ago, too. It must have been lonely to all of a sudden be without his life partner...","Upvotes":10675,"Comment Author":"ASzinhaz","Comment Posted Time":"4 years ago"},{"Comment":"Seriously, there was a thread in here I was reading earlier on today about who you cant believe is still alive and someone mentioned Stan Lee.   No frickin way. ","Upvotes":6788,"Comment Author":"Kolo_ToureHH","Comment Posted Time":"4 years ago"},{"Comment":"[removed]","Upvotes":2991,"Comment Author":"deleted","Comment Posted Time":"4 years ago"},{"Comment":"Not only did this man create an empire that almost everyone loves, but he was a genuine man who just loved to see people smile.   I had the pleasure of working under him for some pop culture conventions and all he wanted was to see fans smile and enjoy his legacy.  He loved to joke with those around him, and he would tease the ever loving hell out of everyone he could.    I remember him using his motorised scooter to get around backstage and his poor assistant would speed walk to keep up with him, but he would just keep increasing the speed until she was running beside him. A wicked grin on his face the whole time.   Or how he would constantly make his staff repeat themselves \"what I didn't hear you!\" Untill they had repeated themselves four times, witnessing that initially made me sad, thinking his hearing was poor, until he looks at me with that same grin and winks.    My time with him was short, but I'm so glad I got it, this man changed my life before I even met him, and he made a huge impact when I did as well.     RIP Stan.  ","Upvotes":2732,"Comment Author":"slightlyalcoholic","Comment Posted Time":"4 years ago"},{"Comment":"[deleted]","Upvotes":2239,"Comment Author":"deleted","Comment Posted Time":"4 years ago"},{"Comment":"He was the highest grossing actor of all time if you include cameos and supporting actors!","Upvotes":2115,"Comment Author":"AmericanHoneycrisp","Comment Posted Time":"4 years ago"},{"Comment":"MODS, CAN WE PLEASE BAN THOSE \"WHO IS STILL ALIVE\" POSTS? THIS TRAGEDY COULD HAVE BEEN AVOIDED","Upvotes":1628,"Comment Author":"TheAngryAlt","Comment Posted Time":"4 years ago"},{"Comment":"I guess over the next few years we will see how many future cameos were filmed early. It will be nice to still see him and know that there is more to look forward to","Upvotes":1126,"Comment Author":"jlobasso","Comment Posted Time":"4 years ago"},{"Comment":"A friend and I snuck into a premiere party for a movie. Thats an r\/actlikeyoubelong story on its own. But we spotted Stan Lee, surrounded by a posse. A lot of pretty girls and some serious handlers. Here we were, just average idiots in a place we werent supposed to be.   We approached, just wanting to say hello and thank him for his work. The handlers were not having any of it and started to move us along. He stopped the handlers and said hello to us. I got to shake his hand and thank him. He asked if we had cameras. I was kinda dumb-struck by the moment, and forgot cameras existed. He actually wanted to pose for pictures with us.  Still have the photo, and a nice memory of a pretty great guy who was good to his fans.   Edit: https:\/\/i.imgur.com\/vFRhI78.jpg ","Upvotes":920,"Comment Author":"buttermuseum","Comment Posted Time":"4 years ago"}]},{"Title":"Reddit, how would you feel about a law that bans radio stations from playing commercials with honking\/beeping\/siren noises in them?","Score":160334,"URL":"https:\/\/www.reddit.com\/r\/AskReddit\/comments\/9gx68l\/reddit_how_would_you_feel_about_a_law_that_bans\/","Post Author":"san69cor","Comments":[{"Comment":"I would feel like \"finally. Lawmakers taking the public's issues to heart.\"","Upvotes":51274,"Comment Author":"SeaSlainCoxswain","Comment Posted Time":"4 years ago"},{"Comment":"I agree, and any ad for a auto service shop that plays squealing brakes or ominous engine sounds as well. ","Upvotes":41090,"Comment Author":"TrollPoster469","Comment Posted Time":"4 years ago"},{"Comment":"[deleted]","Upvotes":22429,"Comment Author":"deleted","Comment Posted Time":"4 years ago"},{"Comment":"I was driving one day and listening to a very popular radio station in my region. And I saw all cars around me on the highway swerve a little bit when a commercial with sirens came on. Very dangerous stuff if you ask me.  Edit: in the city close to where I live carnival is very popular and very well known, for about one month each year the festival gets their own radio station with loud obnoxious party music that is quite funny. Swerve is maybe an exaggeration but I saw the reaction of many drivers in my vicinity since the siren came on quite loud after the news bulletin.","Upvotes":9574,"Comment Author":"MrHiV","Comment Posted Time":"4 years ago"},{"Comment":"Reddit, how do you feel about [common Reddit opinion]?  Edit: The fact that this is #3 for top of this year astounds me.","Upvotes":8823,"Comment Author":"zhy-rr","Comment Posted Time":"4 years ago"},{"Comment":"Also doorbells on commercials because my dogs.","Upvotes":7293,"Comment Author":"effieokay","Comment Posted Time":"4 years ago"},{"Comment":"This is a bad post. Youre asking a leading question that an overwhelmingly majority already agrees with.   Reddit, how would you feel if we had hovercars that didnt run on gas","Upvotes":4200,"Comment Author":"deleted","Comment Posted Time":"4 years ago"},{"Comment":"I want to ban AskReddit posts about shit everyone will agree with ","Upvotes":2341,"Comment Author":"_JosiahBartlet","Comment Posted Time":"4 years ago"},{"Comment":"I'd be fine with it.  Hell, I'd encourage the ban.  I flinch whenever those commercials are played.","Upvotes":1735,"Comment Author":"TheNextLordMormont","Comment Posted Time":"4 years ago"},{"Comment":"Redditors, what are your thoughts on low hanging fruit Ask Reddit questions and diamonds and vaccines?","Upvotes":1437,"Comment Author":"deleted","Comment Posted Time":"4 years ago"}]},{"Title":"Bill Gates said, \"I will always choose a lazy person to do a difficult job because a lazy person will find an easy way to do it.\" What's a real-life example of this?","Score":154350,"URL":"https:\/\/www.reddit.com\/r\/AskReddit\/comments\/himsju\/bill_gates_said_i_will_always_choose_a_lazy\/","Post Author":"lauvnoodles","Comments":[{"Comment":"I knew a guy who had a low level data\/reporting job. He had several daily\/weekly work responsibilities, including a bunch of reports that needed quite a bit of tweaking from raw data to finished product. But like I said, low level.  We didn't find out until way later, but he had set up macros for each of his major responsibilities where he could. Once set up, he'd just run the macros to do his work, but then he'd (smartly) hold off on delivering the reports until just a little before the deadlines.   He'd hit every assignment and was seen as reliable. He also would complain about the workload so people would leave him with that work. I doubt he did a full hour of work a day after he set up what he did.  Eventually he left the job for one with better pay. But damn did he work lazy. Also, he was smart not to reveal until the end, because had he told them about it he would have gotten a pat on the back and would have been given a whole other workload, on top of maintaining those macros\/etc. Dude milked the job, not the other way around.","Upvotes":65153,"Comment Author":"daithisfw","Comment Posted Time":"3 years ago"},{"Comment":"My brother gave  my oldest nephew 10 dollars a week if he did all his chores with out needing to be told or complaining.  One day he gets home early from work and sees. The neighbor kid tossing a bag in the trash.   He asks him what he is doing and the kid says he gets 5 bucks a week to take care of a few chores.   My nephew outsourced his chores.","Upvotes":56469,"Comment Author":"Downvotesdarksouls","Comment Posted Time":"3 years ago"},{"Comment":"I plug clocks in at midnight so they're already set.","Upvotes":35751,"Comment Author":"january21st","Comment Posted Time":"3 years ago"},{"Comment":"An older company had a person dedicated to data entry which boiled down to copying and pasting portions of data from text files into spreadsheet and formatting into a report.   The person originally doing this job spent a full 40+ hours\/week doing it, but was not very computer literate. When they retired, the company hired someone with actual skills. The new hire convinced management to let her work remotely after getting up to speed on the job.   The first week at home was spent automating the entire job. The remainder of their multi-year tenure with the company was spent doing whatever they wanted save the 10-15 minutes weekly to run their program and to answer the odd email here and there. All while getting paid full salary and benefits. They actually had to add in a few errors now and then to make it seem realistic.","Upvotes":34245,"Comment Author":"DLS3141","Comment Posted Time":"3 years ago"},{"Comment":"I worked 'goods in' for an aircraft manufacturer as a summer job at university. Parts would arrive, we'd open them and key in all the details into a terminal. That bit was long winded. I discovered the terminal keyboard has assignable shortcuts, and set up a bunch of them for all the boilerplate such that keying in an item was about six keystrokes. Saved myself and my workmate hours every day, which we would spend pranking each other, other warehouse staff and staff at other sites.","Upvotes":31323,"Comment Author":"john_C_random","Comment Posted Time":"3 years ago"},{"Comment":"I'm doing it right now, automated data cleaning in Python. My coworkers don't know about it, so something that takes me 10 mins at most takes them 2 hours.  Edit. For everyone who says I should share my code, I have. I even set up a private GitHub space for my team. Some have taken it up, but others (including management) do not like it. I think they feel a little threatened.","Upvotes":30628,"Comment Author":"deleted","Comment Posted Time":"3 years ago"},{"Comment":"There's a [repo on Github](https:\/\/github.com\/NARKOZ\/hacker-scripts) containing code based on scripts that were used by a tech employee that his coworkers discovered after he left the company. Here's a summary of his shenanigans:  Edit: repo code is based on the story, not actually from this person  >xxx: OK, so, our build engineer has left for another company. The dude was literally living inside the terminal. You know, that type of a guy who loves Vim, creates diagrams in Dot and writes wiki-posts in Markdown... If something - anything - requires more than 90 seconds of his time, he writes a script to automate that.    >xxx: So we're sitting here, looking through his, uhm, \"legacy\"    >xxx: You're gonna love this    >xxx: [smack-my-bitch-up.sh](https:\/\/github.com\/NARKOZ\/hacker-scripts\/blob\/master\/smack-my-bitch-up.sh) \\- sends a text message \"late at work\" to his wife (apparently). Automatically picks reasons from an array of strings, randomly. Runs inside a cron-job. The job fires if there are active SSH-sessions on the server after 9pm with his login.    >xxx: [kumar-asshole.sh](https:\/\/github.com\/NARKOZ\/hacker-scripts\/blob\/master\/kumar-asshole.sh) \\- scans the inbox for emails from \"Kumar\" (a DBA at our clients). Looks for keywords like \"help\", \"trouble\", \"sorry\" etc. If keywords are found - the script SSHes into the clients server and rolls back the staging database to the latest backup. Then sends a reply \"no worries mate, be careful next time\".    >xxx: [hangover.sh](https:\/\/github.com\/NARKOZ\/hacker-scripts\/blob\/master\/hangover.sh) \\- another cron-job that is set to specific dates. Sends automated emails like \"not feeling well\/gonna work from home\" etc. Adds a random \"reason\" from another predefined array of strings. Fires if there are no interactive sessions on the server at 8:45am.    >xxx: (and the oscar goes to) [fucking-coffee.sh](https:\/\/github.com\/NARKOZ\/hacker-scripts\/blob\/master\/fucking-coffee.sh) \\- this one waits exactly 17 seconds (!), then opens a telnet session to our coffee-machine (we had no frikin idea the coffee machine is on the network, runs linux and has a TCP socket up and running) and sends something like sys brew. Turns out this thing starts brewing a mid-sized half-caf latte and waits another 24 (!) seconds before pouring it into a cup. The timing is exactly how long it takes to walk to the machine from the dudes desk.    >xxx: holy sh\\*t I'm keeping those","Upvotes":29439,"Comment Author":"EarlyHemisphere","Comment Posted Time":"3 years ago"},{"Comment":"Years ago as a student I got a job stocking shelves.  Guys were carrying the heavy boxes, put them on the floor and bend each time to pick up the items to put on the shelves.  I was maybe a light 100 pounds (woman) and carrying the boxes was just killing me physically.  So one day I had an idea.  I put the box on a old desk chair and rolled it around.  No more carrying and no more bending!   Funny thing is that, instead of doing the same thing, most of the guys called me lazy and kept carrying the heavy boxes.  Just to prove how strong they were.  Now they have special rolling carts to do the job.","Upvotes":24364,"Comment Author":"sonia72quebec","Comment Posted Time":"3 years ago"},{"Comment":"An engineer spent hours developing a program so they could start the coffee pot from their desk and not have to wait for coffee when arriving in the break room.","Upvotes":19689,"Comment Author":"FutureRenaissanceMan","Comment Posted Time":"3 years ago"},{"Comment":"  Every year in the Canadian winter, powerlines would fail due to the weight of the snow. It took many days to build up enough to break a line so they employed a team to walk the routes and shake the poles to loosen the snow.  One day they saw a bear shaking the poles and realized that if they could get the bear to do it they wouldn't need to walk the route.  So they gave one guy a bucket of honey and he'd walk the route painting the sides of the poles with honey to attract the bears. It worked for a few more years But this still takes a lot of time to do.  So then they had the idea of flying a helicopter along the route with a trained sniper with honey paintballs that he'd shoot the poles with.  On its maiden flight the helicopter passed the lines and the downdraft blew away all of the snow.  The flights continue to this day but without the sniper.  Typos and grammer fixed by u\/brotherdbad","Upvotes":18941,"Comment Author":"Gingrpenguin","Comment Posted Time":"3 years ago"}]},{"Title":"What if Earth is like one of those uncontacted tribes in South America, like the whole Galaxy knows we're here but they've agreed not to contact us until we figure it out for ourselves?","Score":152120,"URL":"https:\/\/www.reddit.com\/r\/AskReddit\/comments\/kka536\/what_if_earth_is_like_one_of_those_uncontacted\/","Post Author":"slim_p_","Comments":[{"Comment":"What if aliens showed up here millions of years ago, saw a planet inhabited buy enormous lizard monsters and said fuck that, dont come back to this place.","Upvotes":34484,"Comment Author":"ProjectSunlight","Comment Posted Time":"2 years ago"},{"Comment":"What if the people that were abducted by aliens were actually abducted by some alien TV host equivalent of the Crocodile Hunter, where he abducts a human and shows it off? \"crikey what a interesting little fella this is?\"","Upvotes":31008,"Comment Author":"distrucktocon","Comment Posted Time":"2 years ago"},{"Comment":"They probably treat us like animals on National Geographic.","Upvotes":15426,"Comment Author":"Transerbot","Comment Posted Time":"2 years ago"},{"Comment":"Thats the premise of hitchhikers guide to the galaxy except for the waiting for us to figure it out part","Upvotes":14318,"Comment Author":"Niko120","Comment Posted Time":"2 years ago"},{"Comment":"https:\/\/en.m.wikipedia.org\/wiki\/Zoo_hypothesis","Upvotes":13128,"Comment Author":"sonstone","Comment Posted Time":"2 years ago"},{"Comment":"That's actually one of many theories about SETI and alien life. That they're so far ahead of us on the Kardashev scale that for them to try to communicate with us would be like us trying to communicate with ants. Or amoebas.","Upvotes":10012,"Comment Author":"TheMulattoMaker","Comment Posted Time":"2 years ago"},{"Comment":"So...the prime directive?","Upvotes":9541,"Comment Author":"Chemical-Jello9564","Comment Posted Time":"2 years ago"},{"Comment":"I mean we could always just be cosmic ants.  How often do you go out to your garden and try to communicate with the bugs?","Upvotes":7756,"Comment Author":"The-Nightfire","Comment Posted Time":"2 years ago"},{"Comment":"And crop circles are just teenager aliens doing graffitti.","Upvotes":4869,"Comment Author":"Waffleline","Comment Posted Time":"2 years ago"},{"Comment":"Thats already a theory.  Edit: because Im getting messages and comments about this, I wasnt trying to belittle the guy or say this in a manner that implies I didnt want him to post this here. I just thought that maybe he didnt know this concept already existed as Ive done this with other ideas and would like to know.","Upvotes":3131,"Comment Author":"NeverSeenA1Thirteen","Comment Posted Time":"2 years ago"}]}]