[
    {
        "Title": "Bill Gates said, \"I will always choose a lazy person to do a difficult job because a lazy person will find an easy way to do it.\" What's a real-life example of this?",
        "Score": 154342,
        "URL": "https://www.reddit.com/r/AskReddit/comments/himsju/bill_gates_said_i_will_always_choose_a_lazy/",
        "Post Author": "lauvnoodles",
        "Post Date": "3 years ago",
        "Comments": [
            {
                "Comment": "I knew a guy who had a low level data/reporting job. He had several daily/weekly work responsibilities, including a bunch of reports that needed quite a bit of tweaking from raw data to finished product. But like I said, low level.  We didn't find out until way later, but he had set up macros for each of his major responsibilities where he could. Once set up, he'd just run the macros to do his work, but then he'd (smartly) hold off on delivering the reports until just a little before the deadlines.   He'd hit every assignment and was seen as reliable. He also would complain about the workload so people would leave him with that work. I doubt he did a full hour of work a day after he set up what he did.  Eventually he left the job for one with better pay. But damn did he work lazy. Also, he was smart not to reveal until the end, because had he told them about it he would have gotten a pat on the back and would have been given a whole other workload, on top of maintaining those macros/etc. Dude milked the job, not the other way around.",
                "Upvotes": 65155,
                "Comment Author": "daithisfw",
                "Comment Posted Time": "3 years ago"
            },
            {
                "Comment": "My brother gave  my oldest nephew 10 dollars a week if he did all his chores with out needing to be told or complaining.  One day he gets home early from work and sees. The neighbor kid tossing a bag in the trash.   He asks him what he is doing and the kid says he gets 5 bucks a week to take care of a few chores.   My nephew outsourced his chores.",
                "Upvotes": 56476,
                "Comment Author": "Downvotesdarksouls",
                "Comment Posted Time": "3 years ago"
            },
            {
                "Comment": "I plug clocks in at midnight so they're already set.",
                "Upvotes": 35751,
                "Comment Author": "january21st",
                "Comment Posted Time": "3 years ago"
            },
            {
                "Comment": "An older company had a person dedicated to data entry which boiled down to copying and pasting portions of data from text files into spreadsheet and formatting into a report.   The person originally doing this job spent a full 40+ hours/week doing it, but was not very computer literate. When they retired, the company hired someone with actual skills. The new hire convinced management to let her work remotely after getting up to speed on the job.   The first week at home was spent automating the entire job. The remainder of their multi-year tenure with the company was spent doing whatever they wanted save the 10-15 minutes weekly to run their program and to answer the odd email here and there. All while getting paid full salary and benefits. They actually had to add in a few errors now and then to make it seem realistic.",
                "Upvotes": 34240,
                "Comment Author": "DLS3141",
                "Comment Posted Time": "3 years ago"
            },
            {
                "Comment": "I worked 'goods in' for an aircraft manufacturer as a summer job at university. Parts would arrive, we'd open them and key in all the details into a terminal. That bit was long winded. I discovered the terminal keyboard has assignable shortcuts, and set up a bunch of them for all the boilerplate such that keying in an item was about six keystrokes. Saved myself and my workmate hours every day, which we would spend pranking each other, other warehouse staff and staff at other sites.",
                "Upvotes": 31330,
                "Comment Author": "john_C_random",
                "Comment Posted Time": "3 years ago"
            },
            {
                "Comment": "I'm doing it right now, automated data cleaning in Python. My coworkers don't know about it, so something that takes me 10 mins at most takes them 2 hours.  Edit. For everyone who says I should share my code, I have. I even set up a private GitHub space for my team. Some have taken it up, but others (including management) do not like it. I think they feel a little threatened.",
                "Upvotes": 30634,
                "Comment Author": "deleted",
                "Comment Posted Time": "3 years ago"
            },
            {
                "Comment": "Years ago as a student I got a job stocking shelves.  Guys were carrying the heavy boxes, put them on the floor and bend each time to pick up the items to put on the shelves.  I was maybe a light 100 pounds (woman) and carrying the boxes was just killing me physically.  So one day I had an idea.  I put the box on a old desk chair and rolled it around.  No more carrying and no more bending!   Funny thing is that, instead of doing the same thing, most of the guys called me lazy and kept carrying the heavy boxes.  Just to prove how strong they were.  Now they have special rolling carts to do the job.",
                "Upvotes": 24374,
                "Comment Author": "sonia72quebec",
                "Comment Posted Time": "3 years ago"
            },
            {
                "Comment": "An engineer spent hours developing a program so they could start the coffee pot from their desk and not have to wait for coffee when arriving in the break room.",
                "Upvotes": 19683,
                "Comment Author": "FutureRenaissanceMan",
                "Comment Posted Time": "3 years ago"
            },
            {
                "Comment": "  Every year in the Canadian winter, powerlines would fail due to the weight of the snow. It took many days to build up enough to break a line so they employed a team to walk the routes and shake the poles to loosen the snow.  One day they saw a bear shaking the poles and realized that if they could get the bear to do it they wouldn't need to walk the route.  So they gave one guy a bucket of honey and he'd walk the route painting the sides of the poles with honey to attract the bears. It worked for a few more years But this still takes a lot of time to do.  So then they had the idea of flying a helicopter along the route with a trained sniper with honey paintballs that he'd shoot the poles with.  On its maiden flight the helicopter passed the lines and the downdraft blew away all of the snow.  The flights continue to this day but without the sniper.  Typos and grammer fixed by u/brotherdbad",
                "Upvotes": 18944,
                "Comment Author": "Gingrpenguin",
                "Comment Posted Time": "3 years ago"
            }
        ]
    },
    {
        "Title": "What if Earth is like one of those uncontacted tribes in South America, like the whole Galaxy knows we're here but they've agreed not to contact us until we figure it out for ourselves?",
        "Score": 152115,
        "URL": "https://www.reddit.com/r/AskReddit/comments/kka536/what_if_earth_is_like_one_of_those_uncontacted/",
        "Post Author": "slim_p_",
        "Post Date": "2 years ago",
        "Comments": [
            {
                "Comment": "What if aliens showed up here millions of years ago, saw a planet inhabited buy enormous lizard monsters and said fuck that, dont come back to this place.",
                "Upvotes": 34484,
                "Comment Author": "ProjectSunlight",
                "Comment Posted Time": "2 years ago"
            },
            {
                "Comment": "What if the people that were abducted by aliens were actually abducted by some alien TV host equivalent of the Crocodile Hunter, where he abducts a human and shows it off? \"crikey what a interesting little fella this is?\"",
                "Upvotes": 31017,
                "Comment Author": "distrucktocon",
                "Comment Posted Time": "2 years ago"
            },
            {
                "Comment": "They probably treat us like animals on National Geographic.",
                "Upvotes": 15425,
                "Comment Author": "Transerbot",
                "Comment Posted Time": "2 years ago"
            },
            {
                "Comment": "Thats the premise of hitchhikers guide to the galaxy except for the waiting for us to figure it out part",
                "Upvotes": 14314,
                "Comment Author": "Niko120",
                "Comment Posted Time": "2 years ago"
            },
            {
                "Comment": "That's actually one of many theories about SETI and alien life. That they're so far ahead of us on the Kardashev scale that for them to try to communicate with us would be like us trying to communicate with ants. Or amoebas.",
                "Upvotes": 10006,
                "Comment Author": "TheMulattoMaker",
                "Comment Posted Time": "2 years ago"
            },
            {
                "Comment": "I mean we could always just be cosmic ants.  How often do you go out to your garden and try to communicate with the bugs?",
                "Upvotes": 7751,
                "Comment Author": "The-Nightfire",
                "Comment Posted Time": "2 years ago"
            },
            {
                "Comment": "And crop circles are just teenager aliens doing graffitti.",
                "Upvotes": 4873,
                "Comment Author": "Waffleline",
                "Comment Posted Time": "2 years ago"
            }
        ]
    }
]